{"text": "© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Data Mining: Exploring DataLecture Notes for Chapter 3Introduction to Data MiningbyTan, Steinbach, Kumar\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› What is data exploration?Key motivations of data exploration include–Helping to select the right tool for preprocessing or analysis–Making use of humans’ abilities to recognize patternsu People can recognize patterns not captured by data analysis tools Related to the area of Exploratory Data Analysis (EDA)–Created by statistician John Tukey–Seminal book is Exploratory Data Analysis by Tukey–A nice online introduction can be found in Chapter 1 of the NIST Engineering Statistics Handbookhttp://www.itl.nist.gov/div898/handbook/index.htmA preliminary exploration of the data to better understand its characteristics.\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Techniques Used In Data Exploration In EDA, as originally defined by Tukey–The focus was on visualization–Clustering and anomaly detection were viewed as exploratory techniques–In data mining, clustering and anomaly detection are major areas of interest, and not thought of as just exploratoryIn our discussion of data exploration, we focus on–Summary statistics–Visualization–Online Analytical Processing (OLAP) \n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Iris Sample Data Set Many of the exploratory data techniques are illustrated with the Iris Plant data set.–Can be obtained from the UCI Machine Learning Repository http://www.ics.uci.edu/~mlearn/MLRepository.html –From the statistician Douglas Fisher–Three flower types (classes):u Setosau Virginica u Versicolour–Four (non-class) attributesu Sepal width and lengthu Petal width and lengthVirginic"}
{"text": "data set.–Can be obtained from the UCI Machine Learning Repository http://www.ics.uci.edu/~mlearn/MLRepository.html –From the statistician Douglas Fisher–Three flower types (classes):u Setosau Virginica u Versicolour–Four (non-class) attributesu Sepal width and lengthu Petal width and lengthVirginica. Robert H. Mohlenbrock. USDA NRCS. 1995. Northeast wetland flora: Field office guide to plant species. Northeast National Technical Center, Chester, PA. Courtesy of USDA NRCS Wetland Science Institute. \n\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Summary StatisticsSummary statistics are numbers that summarize properties of the data–Summarized properties include frequency, location and spreadu Examples: location - mean spread - standard deviation–Most summary statistics can be calculated in a single pass through the data\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Frequency and ModeThe frequency of an attribute value is the percentage of time the value occurs in the data set –For example, given the attribute ‘gender’ and a representative population of people, the gender ‘female’ occurs about 50% of the time.The mode of a an attribute is the most frequent attribute value The notions of frequency and mode are typically used with categorical data\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› PercentilesFor continuous data, the notion of a percentile is more useful. Given an ordinal or continuous attribute x and a number p between 0 and 100, the pth percentile is a value of x such that p% of the observed values of x are less than . For instance, the 50th percentile is the value such that 50% of all values of x are less than . xp xp xp x50% x50%\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› \nMe"}
{"text": "er p between 0 and 100, the pth percentile is a value of x such that p% of the observed values of x are less than . For instance, the 50th percentile is the value such that 50% of all values of x are less than . xp xp xp x50% x50%\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› \nMeasures of Location: Mean and MedianThe mean is the most common measure of the location of a set of points. However, the mean is very sensitive to outliers. Thus, the median or a trimmed mean is also commonly used.\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Measures of Spread: Range and VarianceRange is the difference between the max and minThe variance or standard deviation is the most common measure of the spread of a set of points. However, this is also sensitive to outliers, so that other measures are often used. \n \n\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› VisualizationVisualization is the conversion of data into a visual or tabular format so that the characteristics of the data and the relationships among data items or attributes can be analyzed or reported.Visualization of data is one of the most powerful and appealing techniques for data exploration. –Humans have a well developed ability to analyze large amounts of information that is presented visually–Can detect general patterns and trends–Can detect outliers and unusual patterns \n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› \nExample: Sea Surface TemperatureThe following shows the Sea Surface Temperature (SST) for July 1982–Tens of thousands of data points are summarized in a single figure \n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› RepresentationIs the mapping of information to a visual formatData objects, their attribu"}
{"text": "eratureThe following shows the Sea Surface Temperature (SST) for July 1982–Tens of thousands of data points are summarized in a single figure \n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› RepresentationIs the mapping of information to a visual formatData objects, their attributes, and the relationships among data objects are translated into graphical elements such as points, lines, shapes, and colors.Example: –Objects are often represented as points–Their attribute values can be represented as the position of the points or the characteristics of the points, e.g., color, size, and shape–If position is used, then the relationships of points, i.e., whether they form groups or a point is an outlier, is easily perceived.\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› ArrangementIs the placement of visual elements within a displayCan make a large difference in how easy it is to understand the dataExample: \n\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› SelectionIs the elimination or the de-emphasis of certain objects and attributesSelection may involve the chossing a subset of attributes –Dimensionality reduction is often used to reduce the number of dimensions to two or three–Alternatively, pairs of attributes can be consideredSelection may also involve choosing a subset of objects– A region of the screen can only show so many points–Can sample, but want to preserve points in sparse areas \n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Visualization Techniques: HistogramsHistogram –Usually shows the distribution of values of a single variable–Divide the values into bins and show a bar plot of the number of objects in each bin. –The height of each bar indicates the number of objects–Shape of"}
{"text": "troduction to Data Mining 8/05/2005 ‹#› Visualization Techniques: HistogramsHistogram –Usually shows the distribution of values of a single variable–Divide the values into bins and show a bar plot of the number of objects in each bin. –The height of each bar indicates the number of objects–Shape of histogram depends on the number of binsExample: Petal Width (10 and 20 bins, respectively) \n\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› \nTwo-Dimensional HistogramsShow the joint distribution of the values of two attributes Example: petal width and petal length–What does this tell us? \n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Visualization Techniques: Box PlotsBox Plots –Invented by J. Tukey–Another way of displaying the distribution of data –Following figure shows the basic part of a box plotoutlier\n10th percentile25th percentile75th percentile50th percentile10th percentile\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› \nExample of Box Plots Box plots can be used to compare attributes\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Visualization Techniques: Scatter PlotsScatter plots –Attributes values determine the position–Two-dimensional scatter plots most common, but can have three-dimensional scatter plots–Often additional attributes can be displayed by using the size, shape, and color of the markers that represent the objects –It is useful to have arrays of scatter plots can compactly summarize the relationships of several pairs of attributesu See example on the next slide\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› \nScatter Plot Array of Iris Attributes\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Visualization Techniques: Contour PlotsConto"}
{"text": "arize the relationships of several pairs of attributesu See example on the next slide\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› \nScatter Plot Array of Iris Attributes\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Visualization Techniques: Contour PlotsContour plots –Useful when a continuous attribute is measured on a spatial grid–They partition the plane into regions of similar values–The contour lines that form the boundaries of these regions connect points with equal values –The most common example is contour maps of elevation–Can also display temperature, rainfall, air pressure, etc.uAn example for Sea Surface Temperature (SST) is provided on the next slide\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Contour Plot Example: SST Dec, 1998\nCelsius\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Visualization Techniques: Matrix PlotsMatrix plots –Can plot the data matrix–This can be useful when objects are sorted according to class–Typically, the attributes are normalized to prevent one attribute from dominating the plot –Plots of similarity or distance matrices can also be useful for visualizing the relationships between objects–Examples of matrix plots are presented on the next two slides\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Visualization of the Iris Data Matrix\nstandarddeviation\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Visualization of the Iris Correlation Matrix\n\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Visualization Techniques: Parallel CoordinatesParallel Coordinates –Used to plot the attribute values of high-dimensional data–Instead of using perpendicular axes, use a set of parallel axes –The attribute values"}
{"text": "s Correlation Matrix\n\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Visualization Techniques: Parallel CoordinatesParallel Coordinates –Used to plot the attribute values of high-dimensional data–Instead of using perpendicular axes, use a set of parallel axes –The attribute values of each object are plotted as a point on each corresponding coordinate axis and the points are connected by a line –Thus, each object is represented as a line –Often, the lines representing a distinct class of objects group together, at least for some attributes–Ordering of attributes is important in seeing such groupings\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Parallel Coordinates Plots for Iris Data\n\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Other Visualization TechniquesStar Plots –Similar approach to parallel coordinates, but axes radiate from a central point–The line connecting the values of an object is a polygonChernoff Faces–Approach created by Herman Chernoff–This approach associates each attribute with a characteristic of a face–The values of each attribute determine the appearance of the corresponding facial characteristic –Each object becomes a separate face–Relies on human’s ability to distinguish faces\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Star Plots for Iris Data\nSetosaVersicolourVirginica\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Chernoff Faces for Iris Data\nSetosaVersicolourVirginica\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› OLAPOn-Line Analytical Processing (OLAP) was proposed by E. F. Codd, the father of the relational database.Relational databases put data into tables, while OLAP uses a multidimensional array representation. –Such r"}
{"text": "rsicolourVirginica\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› OLAPOn-Line Analytical Processing (OLAP) was proposed by E. F. Codd, the father of the relational database.Relational databases put data into tables, while OLAP uses a multidimensional array representation. –Such representations of data previously existed in statistics and other fieldsThere are a number of data analysis and data exploration operations that are easier with such a data representation. \n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Creating a Multidimensional ArrayTwo key steps in converting tabular data into a multidimensional array.–First, identify which attributes are to be the dimensions and which attribute is to be the target attribute whose values appear as entries in the multidimensional array.uThe attributes used as dimensions must have discrete valuesuThe target value is typically a count or continuous value, e.g., the cost of an itemuCan have no target variable at all except the count of objects that have the same set of attribute values–Second, find the value of each entry in the multidimensional array by summing the values (of the target attribute) or count of all objects that have the attribute values corresponding to that entry.\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Example: Iris dataWe show how the attributes, petal length, petal width, and species type can be converted to a multidimensional array–First, we discretized the petal width and length to have categorical values: low, medium, and high–We get the following table - note the count attribute\n\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› \nExample: Iris data (continued)Each unique tuple of petal width, petal length, and species type i"}
{"text": "ized the petal width and length to have categorical values: low, medium, and high–We get the following table - note the count attribute\n\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› \nExample: Iris data (continued)Each unique tuple of petal width, petal length, and species type identifies one element of the array.This element is assigned the corresponding count value. The figure illustrates the result.All non-specified tuples are 0.\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Example: Iris data (continued)Slices of the multidimensional array are shown by the following cross-tabulationsWhat do these tables tell us?\n\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› OLAP Operations: Data CubeThe key operation of a OLAP is the formation of a data cubeA data cube is a multidimensional representation of data, together with all possible aggregates.By all possible aggregates, we mean the aggregates that result by selecting a proper subset of the dimensions and summing over all remaining dimensions.For example, if we choose the species type dimension of the Iris data and sum over all other dimensions, the result will be a one-dimensional entry with three entries, each of which gives the number of flowers of each type. \n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› Consider a data set that records the sales of products at a number of company stores at various dates.This data can be represented as a 3 dimensional arrayThere are 3 two-dimensionalaggregates (3 choose 2 ),3 one-dimensional aggregates,and 1 zero-dimensional aggregate (the overall total)\nData Cube Example\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› The following figure table shows one of the two dimensional agg"}
{"text": " dimensional arrayThere are 3 two-dimensionalaggregates (3 choose 2 ),3 one-dimensional aggregates,and 1 zero-dimensional aggregate (the overall total)\nData Cube Example\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› The following figure table shows one of the two dimensional aggregates, along with two of the one-dimensional aggregates, and the overall totalData Cube Example (continued)\n\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› OLAP Operations: Slicing and DicingSlicing is selecting a group of cells from the entire multidimensional array by specifying a specific value for one or more dimensions. Dicing involves selecting a subset of cells by specifying a range of attribute values. –This is equivalent to defining a subarray from the complete array. In practice, both operations can also be accompanied by aggregation over some dimensions.\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› OLAP Operations: Roll-up and Drill-downAttribute values often have a hierarchical structure.–Each date is associated with a year, month, and week.–A location is associated with a continent, country, state (province, etc.), and city. –Products can be divided into various categories, such as clothing, electronics, and furniture.Note that these categories often nest and form a tree or lattice–A year contains months which contains day–A country contains a state which contains a city\n© Tan,Steinbach, Kumar Introduction to Data Mining 8/05/2005 ‹#› OLAP Operations: Roll-up and Drill-downThis hierarchical structure gives rise to the roll-up and drill-down operations.–For sales data, we can aggregate (roll up) the sales across all the dates in a month. –Conversely, given a view of the data where the time dimension is broken into mont"}
{"text": "5/2005 ‹#› OLAP Operations: Roll-up and Drill-downThis hierarchical structure gives rise to the roll-up and drill-down operations.–For sales data, we can aggregate (roll up) the sales across all the dates in a month. –Conversely, given a view of the data where the time dimension is broken into months, we could split the monthly sales totals (drill down) into daily sales totals.–Likewise, we can drill down or roll up on the location or product ID attributes."}
