{"text": "Surat Komitmen NAWASENA HMTC 2024 \n \nSaya yang bertanda tangan dibawah ini: \n \nNama : Badruzzaman Nafiz \nNRP : 502523119 6 \n \nmenyatakan BERSEDIA untuk mengikuti seluruh rangkaian kegiatan NAWASENA yang \ndiselenggarakan oleh Himpunan Mahasiswa Teknik Computer -Informatika periode 2024. \nDengan ketentuan yang berlaku sebagaimana tercantum di bawah ini. \n \n1. Bersikap sopan kepada Panitia NAWASENA dan kepada sesama Peserta \nNAWASENA. \n2. Memberi informasi dan alasan yang jelas kepada Panitia NAWASENA apabila tidak \ndapat menghadiri kegiatan secara penuh (telat atau menyusul) dan juga jika terjadi \ngangguan aksesibilitas internet selama keberjalanan kegiatan. \n3. Mengerjakan dan menyelesaikan tugas yang diberikan oleh Panitia NAWASENA \nsebaik mungkin dan tepat waktu. \n4. Datang tepat waktu pada setiap kegiatan. \n5. Mengenakan pakaian rapi dan sopan (sesuai kesepakatan). \n6. Memaksimalkan usaha interaksi antara panitia dengan peserta (mengangkat tangan \npada saat offline, menyalakan kamera dan mikrofon pada saat online). \n7. Melaksanakan kegiatan dengan posisi duduk sopan di depan kamera ketika menyalakan \nkamera dengan minimal: \na. Wajah terlihat jelas \nb. Rambut tidak menutupi wajah "}
{"text": " dan mikrofon pada saat online). \n7. Melaksanakan kegiatan dengan posisi duduk sopan di depan kamera ketika menyalakan \nkamera dengan minimal: \na. Wajah terlihat jelas \nb. Rambut tidak menutupi wajah \n8. Menggunakan platform berinteraksi dengan bijaksana (tetap kondusif, tidak mencela, \ndan tidak menyinggung SARA). \n9. Menggunakan bahasa (baik tutur maupun tulis) yang sopan dan jelas. \n10. Tidak diperkenankan untuk mengirim pesan spam di setiap platform yang digunakan \ndalam berkegiatan. \n11. Tidak diperkenankan makan pada saat kegiatan berlangsung (kecuali pada jam \nistirahat). \n12. Tidak merokok atau vape selama berjalannya kegiatan. \n13. Menjunjung tinggi nilai integritas dalam melaksanakan kegiatan. \n14. Mengusahakan untuk fokus (meminimalkan distraksi) pada pelaksanaan kegiatan. \n15. Menjaga nama baik HMTC ITS. \nSaya dengan sadar bahwasannya saya bertanda tangan dibawah ini dengan sadar bahwa saya \nikut kegiatan NAWASENA atas kemauan saya sendiri dan saya berhak untuk mengajukan atau \nberhak keluar pada kegiatan NAWASENA jika tidak sesuai dengan aturan yang sudah \ndisebutkan diatas \nSurabaya, XX Juni 2024 \n \n \n \nBadruzzaman Nafiz \n5025231196"}
